Repository: AutisticShark/rrdtool-no-watermark
Catalog: po/*.po
Languages: ka

source: RRDtool %s Copyright by Tobias Oetiker <tobi@oetiker.ch> Compiled %s Usage: rrdtool [options] command command_options
ka: RRDtool %s საავტორო უფლებები დაცულია Tobias Oetiker <tobi@oetiker.ch> აგება %s გამოყენება: rrdtool [პარამეტრები] ბრძანება ბრძანების_პარამეტრები

source: RRDtool %s Copyright by Tobias Oetiker <tobi@oetiker.ch> Compiled %s %s Usage: rrdtool [options] command command_options
ka: RRDtool %s საავტორო უფლებები დაცულია Tobias Oetiker <tobi@oetiker.ch> აგება %s %s გამოყენება: rrdtool [პარამეტრები] ბრძანება ბრძანების პარამეტრები

source: Valid commands: create, update, updatev, graph, graphv, dump, restore, last, lastupdate, first, info, list, fetch, tune, resize, xport, flushcached
ka: სწორი ბრძანებებია: create, update, updatev, graph, graphv, dump, restore, last, lastupdate, first, info, list, fetch, tune, resize, xport, flushcached

source: Valid remote commands: quit, ls, cd, mkdir, pwd
ka: სწორი დაშორებული ბრძანებებია: quit, ls, cd, mkdir, pwd

source: * create - create a new RRD rrdtool create filename [--start|-b start time] [--step|-s step] [--template|-t template-file] [--source|-r source-file] [--no-overwrite|-O] [--daemon|-d address] [DS:ds-name:DST:dst arguments] [RRA:CF:cf arguments]
ka: * create - ახალი RRD-ის შექმნა rrdtool create ფაილისსახელი [--start|-b დაწყების_დრო] [--step|-s ნაბიჯი] [--template|-t ნიმუში_ფაილი] [--source|-r წყარო-ფაილი] [--no-overwrite|-O] [--daemon|-d მისამართი] [DS:ds-name:DST:dst არგუმენტები] [RRA:CF:cf არგუმენტები]

source: * dump - dump an RRD to XML rrdtool dump [--header|-h {none,xsd,dtd}] [--no-header|-n] [--daemon|-d address] file.rrd [file.xml]
ka: * dump - RRD-ის დამპი XML-ში rrdtool dump [--header|-h {none,xsd,dtd}] [--no-header|-n] [--daemon|-d მისამართი] file.rrd [file.xml]

source: * info - returns the configuration and status of the RRD rrdtool info [--daemon|-d <addr> [--noflush|-F]] filename.rrd
ka: * info - აბრუნებს RRD-ის კონფიგურაციას და სტატუსს rrdtool info [--daemon|-d <მისამართი> [--noflush|-F]] filename.rrd

source: * list - returns the list of RRDs rrdtool list [--daemon <address>] [--noflush] <dirname>
ka: * list - აბრუნებს RRD-ების სიას rrdtool list [--daemon <მისამართი>] [--noflush] <საქაღ_სახელი>

source: * restore - restore an RRD file from its XML form rrdtool restore [--range-check|-r] [--force-overwrite|-f] filename.xml filename.rrd
ka: * restore - აღადგენს RRD ფაილს მისი XML ფორმიდან rrdtool restore [--range-check|-r] [--force-overwrite|-f] filename.xml filename.rrd

source: * last - show last update time for RRD rrdtool last filename.rrd [--daemon|-d address]
ka: * last - აჩვენებს ბოლო განახლების დროს RRD-სთვის rrdtool last filename.rrd [--daemon|-d მისამართი]

source: * lastupdate - returns the most recent datum stored for each DS in an RRD rrdtool lastupdate filename.rrd [--daemon|-d address]
ka: * lastupdate - აბრუნებს უახლეს თარიღს, რომელიც დამახსოვრებულია თითოეული DS-სთვის RRD-ში rrdtool lastupdate filename.rrd [--daemon|-d მისამართი]

source: * first - show first update time for RRA within an RRD rrdtool first filename.rrd [--rraindex number] [--daemon|-d address]
ka: * first - აჩვენებს პირველი განახლების დროს RRA-სთვის RRD-ის შიგნით rrdtool first filename.rrd [--rraindex რიცხვი] [--daemon|-d მისამართი]

source: * update - update an RRD rrdtool update filename [--template|-t ds-name:ds-name:...] [--skip-past-updates|-s] [--daemon|-d <address>] time|N:value[:value...] at-time@value[:value...] [ time:value[:value...] ..]
ka: * update - RRD-ის განახლება rrdtool update ფაილისსახელი [--template|-t ds-name:ds-name:...] [--skip-past-updates|-s] [--daemon|-d <მისამართი>] დრო|N:მნიშვნელობა[:მნიშვნელობა...] დრო@მნიშვნელობა[:მნიშვნელობა...] [ დრო:მნიშვნელობა[:მნიშვნელობა...] ..]

source: * updatev - a verbose version of update returns information about values, RRAs, and datasources updated rrdtool updatev filename [--template|-t ds-name:ds-name:...] [--skip-past-updates|-s] time|N:value[:value...] at-time@value[:value...] [ time:value[:value...] ..]
ka: * updatev - განახლების მეტი შეტყობინების გამოტანა აბრუნებს ინფორმაციას მნიშვნელობების, RRA-ების და მონაცემების განახლებული წყაროების შესახებ rrdtool updatev ფაილისსახელი [--template|-t ds-name:ds-name:...] [--skip-past-updates|-s] time|N:მნიშვნელობა[:მნიშვნელობა...] at-time@მნიშვნელობა[:მნიშვნელობა...] [ time:მნიშვნელობა[:მნიშვნელობა...] ..]

source: * fetch - fetch data out of an RRD rrdtool fetch filename.rrd CF [-r|--resolution resolution] [-s|--start start] [-e|--end end] [-a|--align-start] [-d|--daemon <address>]
ka: * fetch - მონაცემების გამოთხოვა RRD-დან rrdtool fetch filename.rrd CF [-r|--resolution გაფართოება] [-s|--start დასაწყისი] [-e|--end დასასრული] [-a|--align-start] [-d|--daemon <მისამართი>]

source: * flushcached - flush cached data out to an RRD file rrdtool flushcached filename.rrd [-d|--daemon <address>]
ka: * flushcached - დაკეშილი მონაცემების მოცილება RRD ფაილიდან rrdtool flushcached filename.rrd [-d|--daemon <მისამართი>]

source: * graph - generate a graph from one or several RRD rrdtool graph filename [-s|--start seconds] [-e|--end seconds]
ka: * graph - გრაფიკის გენერაცია ერთი ან მეტი RRD-დან rrdtool graph ფაილისსახელი [-s|--start წამი] [-e|--end წამი]

source: * graphv - generate a graph from one or several RRD with meta data printed before the graph rrdtool graphv filename [-s|--start seconds] [-e|--end seconds]
ka: * graphv - გრაფიკის შექმნა ერთი ან მეტი RRD-დან მეტამონაცემების გრაფიკამდე გამოტანით rrdtool graphv ფაილისსახელი [-s|--start წამი] [-e|--end წამი]

source: [-x|--x-grid x-axis grid and label] [-Y|--alt-y-grid] [--full-size-mode] [--left-axis-format format] [-y|--y-grid y-axis grid and label] [-v|--vertical-label string] [-w|--width pixels] [--right-axis scale:shift] [--right-axis-label label] [--right-axis-format format] [-h|--height pixels] [-o|--logarithmic] [-u|--upper-limit value] [-z|--lazy] [-l|--lower-limit value] [-r|--rigid] [-g|--no-legend] [-d|--daemon <address>] [-F|--force-rules-legend] [-j|--only-graph]
ka: [-x|--x-grid x-ღერძი ბადე და ჭდე] [-Y|--alt-y-grid] [--full-size-mode] [--left-axis-format format] [-y|--y-grid y-ღერძი ბადე და ჭდე] [-v|--vertical-label სტრიქონი] [-w|--width პიქსელი] [--right-axis scale:shift] [--right-axis-label ჭდე] [--right-axis-format ფორმატი] [-h|--height პიქსელი] [-o|--logarithmic] [-u|--upper-limit მნიშვნელობა] [-z|--lazy] [-l|--lower-limit მნიშვნელობა] [-r|--rigid] [-g|--no-legend] [-d|--daemon <მისამართი>] [-F|--force-rules-legend] [-j|--only-graph]

source: [-n|--font FONTTAG:size:font] [-m|--zoom factor] [-A|--alt-autoscale] [-M|--alt-autoscale-max] [-G|--graph-render-mode {normal,mono}] [-R|--font-render-mode {normal,light,mono}] [-B|--font-smoothing-threshold size] [-T|--tabwidth width] [-E|--slope-mode] [-P|--pango-markup] [-N|--no-gridfit] [-X|--units-exponent value] [-L|--units-length value] [-S|--step seconds] [-f|--imginfo printfstr] [-a|--imgformat PNG] [-c|--color COLORTAG#rrggbb[aa]] [--border width [-t|--title string] [-W|--watermark string] [-Z|--use-nan-for-all-missing-data] [--add-jsontime] [--utc] [DEF:vname=rrd:ds-name:CF]
ka: [-n|--font FONTTAG:ზომა:ფონტი] [-m|--zoom კოეფიციენტი] [-A|--alt-autoscale] [-M|--alt-autoscale-max] [-G|--graph-render-mode {normal,mono}] [-R|--font-render-mode {normal,light,mono}] [-B|--font-smoothing-threshold ზომა] [-T|--tabwidth სიგანე] [-E|--slope-mode] [-P|--pango-markup] [-N|--no-gridfit] [-X|--units-exponent მნიშვნელობა] [-L|--units-length მნიშვნელობა] [-S|--step წამი] [-f|--imginfo printfstr] [-a|--imgformat PNG] [-c|--color COLORTAG#rrggbb[aa]] [--border სიგანე [-t|--title სტრიქონი] [-W|--watermark სტრიქონი] [-Z|--use-nan-for-all-missing-data] [--add-jsontime] [--utc] [DEF:vname=rrd:ds-name:CF]

source: [CDEF:vname=rpn-expression] [VDEF:vdefname=rpn-expression] [PRINT:vdefname:format] [GPRINT:vdefname:format] [COMMENT:text] [SHIFT:vname:offset] [TEXTALIGN:{left|right|justified|center}] [TICK:vname#rrggbb[aa][:[fraction][:legend]]] [HRULE:value#rrggbb[aa][:legend]] [VRULE:value#rrggbb[aa][:legend]] [LINE[width]:vname[#rrggbb[aa][:[legend][:STACK]]]] [AREA:vname[#rrggbb[aa][:[legend][:STACK]]]] [PRINT:vname:CF:format] (deprecated) [GPRINT:vname:CF:format] (deprecated) [STACK:vname[#rrggbb[aa][:legend]]] (deprecated)
ka: [CDEF:vname=rpn-expression] [VDEF:vdefname=rpn-expression] [PRINT:vdefname:ფორმატი] [GPRINT:vdefname:ფორმატი] [COMMENT:ტექსტი] [SHIFT:vname:offset] [TEXTALIGN:{left|right|justified|center}] [TICK:vname#rrggbb[aa][:[fraction][:legend]]] [HRULE:value#rrggbb[aa][:legend]] [VRULE:value#rrggbb[aa][:legend]] [LINE[width]:vname[#rrggbb[aa][:[legend][:STACK]]]] [AREA:vname[#rrggbb[aa][:[legend][:STACK]]]] [PRINT:vname:CF:format] (მოძველებულია) [GPRINT:vname:CF:format] (მოძველებულია) [STACK:vname[#rrggbb[aa][:legend]]] (მოძველებულია)

source: * tune - Modify some basic properties of an RRD rrdtool tune filename [--heartbeat|-h ds-name:heartbeat] [--data-source-type|-d ds-name:DST] [--data-source-rename|-r old-name:new-name] [--minimum|-i ds-name:min] [--maximum|-a ds-name:max] [--deltapos|-p scale-value] [--deltaneg|-n scale-value] [--failure-threshold|-f integer] [--window-length|-w integer] [--alpha|-x adaptation-parameter]
ka: * tune - RRD-ის ზოგიერთი თვისების შეცვლა rrdtool tune filename [--heartbeat|-h ds-name:heartbeat] [--data-source-type|-d ds-name:DST] [--data-source-rename|-r ძველი-სახელი:ახალი-სახელი] [--minimum|-i ds-name:min] [--maximum|-a ds-name:max] [--deltapos|-p scale-value] [--deltaneg|-n scale-value] [--failure-threshold|-f მთელირიცხვი] [--window-length|-w მთელირიცხვი] [--alpha|-x adaptation-parameter]

source: [--step|-t newstep] [--daemon|-D address] [DEL:ds-name] [DS:ds-spec] [DELRRA:index] [RRA:rra-spec] [RRA#index:[+-=]number]
ka: [--step|-t newstep] [--daemon|-D მისამართი] [DEL:ds-name] [DS:ds-spec] [DELRRA:ინდექსი] [RRA:rra-spec] [RRA#index:[+-=]რიცხვი]

source: * resize - alter the length of one of the RRAs in an RRD rrdtool resize filename rranum GROW|SHRINK rows
ka: * resize - ერთ-ერთი RRA-ის ზომის შეცვლა RRD-ში rrdtool resize ფაილისსახელი rranum GROW|SHRINK მწკრივი

source: * xport - generate XML dump from one or several RRD rrdtool xport [-s|--start seconds] [-e|--end seconds] [-m|--maxrows rows] [--step seconds] [-t|--showtime] [--enumds] [--json] [-d|--daemon address] [DEF:vname=rrd:ds-name:CF] [CDEF:vname=rpn-expression] [XPORT:vname:legend]
ka: * xport - XML დამპის გენერაცია ერთი ან მეტი RRD-დან rrdtool xport [-s|--start წამი] [-e|--end წამი] [-m|--maxrows მწკრივები] [--step წამი] [-t|--showtime] [--enumds] [--json] [-d|--daemon მისამართი] [DEF:vname=rrd:ds-name:CF] [CDEF:vname=rpn-expression] [XPORT:vname:legend]

source: * quit - closing a session in remote mode rrdtool quit
ka: * quit - სესიის დახურვა დაშორებულ რეჟიმში rrdtool quit

source: * ls - lists all *.rrd files in current directory rrdtool ls
ka: * ls - *.rrd ფაილების ჩამონათვალი მიმდინარე საქაღალდეში rrdtool ls

source: * cd - changes the current directory rrdtool cd new directory
ka: * cd - ცვლის მიმდინარე საქაღალდეს rrdtool cd ახალი საქაღალდე

source: * mkdir - creates a new directory rrdtool mkdir newdirectoryname
ka: * mkdir - შექმნის ახალ საქაღალდეს rrdtool mkdir ახალისაქაღალდისსახელი

source: * pwd - returns the current working directory rrdtool pwd
ka: * pwd - აბრუნებს მიმდინარე სამუშაო საქაღალდეს rrdtool pwd

source: RRDtool is distributed under the Terms of the GNU General Public License Version 2. (www.gnu.org/copyleft/gpl.html) For more information read the RRD manpages
ka: RRDtool ვრცელდება GNU General Public License Version 2-ის წესების მიხედვით. (www.gnu.org/copyleft/gpl.html) მეტი ინფორმაციისთვის წაიკითხეთ RRD man-გვერდები
